[{
        "id": "CB_001",
        "title": "Acceptance",
        "description": "We all go through struggles in life and if we don’t push forward we will always be stuck in the past. Acceptance shows the good times and the bad, but most importantly it shows how we must all be proud of our failings because they are what help us see our path to success.",
        "subtitle": "for concert band",
        "youtube": "<iframe width='560' height='315' src='https://youtube.com/embed/carCT-SMzig' title='YouTube video player' frameborder='0' allow='accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture' allowfullscreen></iframe>",
        "ensemble": "",
        "copyright": "&copy; Taylor Reese King 2021",
        "composer_if_arranged": null,
        "display": true,
        "popup": false,
        "video": false
    },
    {
        "id": "CB_003",
        "title": "Life's Lessons",
        "description": "Life’s Lessons is dedicated to a good friend of mine who helped me through some rough times in my junior year of high school (2017). I wrote this as a thank you for all the help they provided me with and the positive memories they gave me. Their teachings were invaluable.",
        "subtitle": "for concert band",
        "ensemble": "",
        "copyright": "&copy; Taylor Reese King 2021",
        "composer_if_arranged": null,
        "display": true,
        "popup": false,
        "video": false,
        "youtube": ""
    },
    {
        "id": "SYOR_002",
        "title": "Concerto For Alto Saxophone",
        "description": "This piece was written for two of my saxophone instructors over the past few years, Rodney Zuroeveste and Sandon Mayhew, who have helped me as a saxophonist, musician, but most importantly, as a person. I started writing Concerto for Alto Saxophone in April 2019 and finished it the following December. My performance of this piece won a spot in the 2020 Boise State University Concerto Aria Competition, but due to COVID-19, the concert was unfortunately cancelled so I wasn’t able to premier the orchestral version. To finish my 2020 recital at Boise State University on February 20th, I premiered the 2 piano version with Del Parkinson and Peggy Purdy, two accompanists who have always supported me. I wish to use this piece to say thank you to all my instructors who have taught me and convey a special gratitude to Rodney Zuroeveste and Sandon Mayhew.",
        "subtitle": "for orchestra",
        "ensemble": "",
        "copyright": "&copy; Taylor Reese King 2021",
        "composer_if_arranged": null,
        "display": true,
        "popup": false,
        "video": false,
        "youtube": ""
    },
    {
        "id": "SYOR_001",
        "title": "Concerto For Alto Trombone",
        "description": "A good freind of mine, Wesley Nielson recently got an alto trombone and asked me to write something for him, but only under one condition: that it be 'sexy.'",
        "subtitle": "for orchestra",
        "ensemble": "",
        "copyright": "&copy; Taylor Reese King 2021",
        "composer_if_arranged": null,
        "display": true,
        "popup": false,
        "video": false,
        "youtube": ""
    },
    {
        "id": "CBR_001",
        "title": "Fleeting Moments",
        "description": "It is my belief music is a collection of moments all put together to create one living and breathing entity. When performed, each moment only happens once and never again, but each one contributes to another. To me, this is analogous to who we, as people, are. Every single person has millions and millions of moments that they are made of which came and went in the blink of an eye. We have a way of looking back on these moments with photographs and memories, but those moments will never happen again. Each person contributes to the people’s moments around them, so let’s make the best of them. Be the best who you can be.",
        "subtitle": "for horn and piano",
        "youtube": "<iframe width='560' height='315' src='https://youtube.com/embed/lrooTxpNwyY' title='YouTube video player' frameborder='0' allow='accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture' allowfullscreen></iframe>",
        "ensemble": "Horn and Piano",
        "copyright": "&copy; Taylor Reese King 2021",
        "composer_if_arranged": null,
        "display": true,
        "popup": false,
        "video": false
    },
    {
        "id": "CBR_002",
        "title": "Remembrance",
        "description": "This piece was finished in 2017 shortly before my grandfather died, and was premiered the day after his passing. His unconditional love is always something I will remember and cherish. This piece is for you, Verl King.",
        "subtitle": "for saxophone, cello, and piano",
        "ensemble": "Saxophone, Cello, and Piano",
        "copyright": "&copy; Taylor Reese King 2021",
        "composer_if_arranged": null,
        "display": true,
        "popup": false,
        "video": false,
        "youtube": ""
    },
    {
        "id": "CBR_006",
        "title": "Appalachian Spring",
        "description": "This was a fun project I did back in high school for me to learn how to write for various instruments and to study Aaron Copland's writing style. This was entirely for self-educational purposes only, and I have no intention of selling this music, only to become a better composer!",
        "subtitle": "for wind sextet",
        "ensemble": "Flute, Alto/Soprano Saxophone, Bassoon, Horn, Trumpet/Flugelhorn, and Piano",
        "copyright": "",
        "composer_if_arranged": "Aarond Copland",
        "display": true,
        "popup": true,
        "video": false,
        "youtube": ""
    },
    {
        "id": "MB_001",
        "title": "Olympics Show",
        "description": "This was a fun project I did with a friend of mine, Josh Chastain, who wrote the drill! We just wanted to get our feet wet in marching show design so we decided on doing the Olympics for the 2020 season! (Which we all know how that turned out) This was entirely for us to learn how to write for marching band, and we have no intention of selling this music, 100% for educational purposes only.",
        "subtitle": "for marching band",
        "youtube": "<iframe width='560' height='315' src='https://www.youtube.com/embed/Kge0AACxacY?start=3' title='YouTube video player' frameborder='0' allow='accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture' allowfullscreen></iframe>",
        "ensemble": "",
        "copyright": "",
        "composer_if_arranged": "John Williams and Vangelis",
        "display": true,
        "popup": true,
        "video": true
    }
]